Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཐུགས་སུ་ཆུད་པའི་གནས་གང་ལ་ཞུ་བ་ཞུས་པའི་སྤོབས་པ་མི་ཟད་དོ། །
en: has inexhaustible eloquence when asked regarding any topic of his knowledge.

source: དེ་ལྟ་བས་ན་འདིར་གང་གི་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པ་མེད་པར་འཇུག་པ་དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, with his unimpeded wisdom vision he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ། ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of what is possible.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་གནས་ཤེས་པ། ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of what is possible.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་སྡུག་བསྔལ་བར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ནང་དུ་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་འབྲས་བུ་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་ཟུག་རྔུར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་སྡིག་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་གནོད་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་ཆུང་ངུར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་འཇིག་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་གཡོ་བ་ཉིད་དུ་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་རབ་ཏུ་འཇིག་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་འགོ་བའི་ནད་དུ་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་སྟོང་པ་ཉིད་དུ་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་བདག་མེད་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་དབུགས་དབྱུང་བ་མེད་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་བལྟ་བར་གནས་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding whether he considers impermanence, suffering, inner phenomena, results, unease, evil, harm, the lesser, disintegration, movement, destruction, epidemics, emptiness, lack of self, discomfort, shortcomings, or deliverance.

source: དེ་ནི་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: That is called knowing the origin as related to knowledge of what is possible and

source: དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: this is what the Thus-Gone One correctly understands.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Moreover, householder, this is how the Thus-Gone One knows:

source: གང་ཟག་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཁྲག་ཁྲིག་དེ་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས།
en: ‘Since these people have produced roots of virtue with billions of thus-gone ones,

source: གནས་ཤེས་པ་ལ་ངེས་པར་འབྱུང་བ་ཞེས་བྱ་སྟེ།
en: they have become certain with regard to knowing what is possible.’

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of what is possible.

source: དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about knowing the origin as related to knowledge of what is possible,

source: བསྐལ་པར་ལན་གསུང་བ་ནས།
en: he can respond for an eon, and

source: བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་སྟེ།
en: he can respond [for an eon], and so forth, up until an inexpressible number of inexpressible eons, since

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་བླ་ན་མེད་པ་མཁྱེན་རབ་ཀྱིས་ཤིན་ཏུ་ཐུགས་སུ་ཆུད་པར་མཛད་དེ།
en: It is because in his wisdom the Thus-Gone One knows the matchless sphere of reality.

source: གང་ཐུགས་སུ་ཆུད་པའི་དེ་བཞིན་གཤེགས་པ་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་ཞུ་བ་ཞུས་པའི་སྤོབས་པ་མི་ཟད་དོ། །
en: In this way the Thus-Gone One possesses inexhaustible eloquence when asked about knowing the origin as related to knowledge of what is possible.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of what is possible.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་། དོན་མ་ཡིན་པ་ཟློག་ལ་སྣང་བ་བྱས་ཤིང་མུན་པ་བསལ་ཏེ།
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them. He illuminated them and cleared away their darkness.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས་བདེ་བ་ལ་བཙུད་པ་ནི་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of what is possible.

source: ཚོགས་པ་བྲལ་བས་འགགས་ཤིང་ཚོགས་པ་སྦྱོར་བས་གནས་ཤེས་པ་སྐྱེས་ལ་དེ་ཡང་གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཆོས་ཅན་ཏེ།
en: When an assemblage is lacking there is an obstruction of knowledge, but when an assemblage takes place, knowledge of what is possible arises. Moreover, this is primordially unborn.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of what is possible.

source: དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of what is possible,

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་བླ་ན་མེད་པ་མཁྱེན་རབ་ཀྱིས་ཤིན་ཏུ་ཐུགས་སུ་ཆུད་དེ།
en: It is because in his wisdom the Thus-Gone One knows the matchless sphere of reality.

source: གང་ཐུགས་སུ་ཆུད་པའི་དེ་བཞིན་གཤེགས་པ་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་ལ་ཞུ་བ་ཞུས་པའི་སྤོབས་པ་མི་ཟད་དོ། །
en: In this way the Thus-Gone One possesses inexhaustible eloquence when asked about the knowledge of cessation as related to knowledge of what is possible.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of what is possible.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡོངས་སུ་ཤེས་པ་ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge by which he knows, understands, and actualizes the knowledge of the path that leads to cessation as related to knowledge of what is possible.

source: གལ་ཏེ་རོ་མྱོང་བ་མེད་པར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་བལྟ་བར་གནས་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance, the Thus-Gone One correctly understands.

source: འདི་ནི་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: That is called knowledge of the path that leads to cessation as related to knowledge of what is possible .

source: དེ་བཞིན་གཤེགས་པ་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of what is possible,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་སྟེ།
en: he can respond for an eon, and so forth, up until an inexpressible number of inexpressible eons, since

source: གང་ཐུགས་སུ་ཆུད་པའི་དེ་བཞིན་གཤེགས་པ་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་ཞུ་བ་ཞུས་པའི་སྤོབས་པ་མི་ཟད་དོ། །
en: In this way the Thus-Gone One possesses inexhaustible eloquence when asked about knowledge of the path that leads to cessation as related to knowledge of what is possible.

source: ཁྱིམ་བདག་གཞན་ཡང་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of what is impossible.

source: ལུས་ཀྱིས་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་འདོད་པ་སྡུག་པ་ཡིད་དུ་འོང་བ་འགྲུབ་པ་གང་ཡིན་པ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is impossible and unfeasible that the ripening of negative physical actions is desirable, beautiful, and pleasant.

source: ངག་གིས་ཉེས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་འདོད་པ། སྡུག་པ་ཡིད་དུ་འོང་བ་འགྲུབ་པ་གང་ཡིན་པ་དེ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that the ripening of negative verbal actions and negative mental actions is desirable, beautiful, and pleasant.

source: ལུས་ཀྱིས་ཉེས་པར་སྤྱད་པ་དང་། ངག་གིས་ཉེས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that the ripening of negative physical, verbal, and mental acts leads to birth in a delightful destiny within the higher realms after the body disintegrates and one dies.

source: ལུས་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་མི་འདོད་པ་མི་སྡུག་པ་ཡིད་དུ་མི་འོང་བ་མངོན་པར་འགྲུབ་པ་གང་ཡིན་པ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that the ripening of positive physical actions is undesirable, repulsive, and unpleasant.

source: ངག་གིས་ལེགས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པ་ཡང་དེ་བཞིན་ནོ། །
en: The same applies to positive verbal and mental acts.

source: ལུས་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བ་གང་ཡིན་པ་དང་།
en: It is also impossible and unfeasible that by committing positive physical acts, after the body disintegrates and one dies, one will fall into the sad destinies of the lower realms and take birth in the hells.

source: དེ་བཞིན་དུ་ངག་གིས་ལེགས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that by committing positive verbal and mental acts, after the body disintegrates and one dies, one will fall into the sad destinies of the lower realms and take birth in the hells.

source: ལྟ་བ་ཕུན་སུམ་ཚོགས་པའི་གང་ཟག་གིས་བསམས་བཞིན་དུ་མ་སྲོག་དང་ཕྲལ་བ་དང་། དེ་བཞིན་དུ་ཕ་དང་། དེ་བཞིན་དུ་དགྲ་བཅོམ་པ་དང་། དེ་བཞིན་དུ་དགེ་འདུན་ཕྱེ་བ་དང་། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ལ་ངན་སེམས་ཀྱིས་ཁྲག་ཕྱུང་བ་གང་ཡིན་པ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that people who have the correct view would willingly end the life of their mother, or their father, or a worthy one, or cause a schism in the saṅgha, or with evil intentions draw blood from the body of the Thus-Gone One.

source: ལྟ་བ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པའི་གང་ཟག་གིས་སྟོན་པ་གཞན་རྣམ་པར་བསྟན་པ་དང་། དེ་བཞིན་དུ་འདི་ལས་ཕྱི་རོལ་པ་གཞན་གྱིས་ཡང་དག་པའི་ལྟ་བ་འཆའ་ཞིང་བཅས་པ་དང་། སྦྱངས་པ་གཞན་ཡང་དག་པར་ལེན་དུ་འཇུག་པ་དང་།
en: people who have the correct view would adopt the teachings of other extremist teachers and the views of such teachers, and engage in their practices.

source: དགེ་སྦྱོང་དང་བྲམ་ཟེ་གང་ཡང་རུང་བ་ལ་ལ་དག་གིས་དགེ་མཚན་དང་། བཀྲ་ཤིས་མང་པོ་སོ་སོའི་བདེན་པ་དེ་དག་གིས་དག་པར་འདོད་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེ་གཞན་དག་གིས་བཤད་པ་ལ་ཕྱོགས་ཤིང་། ཚེ་དང་ལྡན་པ་ཤེས་པར་བྱ་བ་འདི་ནི་ཤེས་པར་བྱ།
en: They will not perceive any benefits or auspicious qualities in such religious practitioners and brahmins, nor will they adopt what those ascetics and brahmins have taught, and say to others, ‘You must meet this venerable teacher!

source: གང་ཡིན་པ་ཡང་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that

source: ལྟ་བ་ཕུན་སུམ་ཚོགས་པའི་གང་ཟག་གིས་མིའི་སྲིད་པ་བརྒྱད་མངོན་པར་འགྲུབ་པ་གང་ཡིན་པ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that people who have the correct view obtain the eight human existences.

source: བུད་མེད་བདག་གི་དངོས་པོ་དེ་ཉིད་ཀྱིས་བརྒྱ་བྱིན་ནམ། བདུད་དམ། ཚངས་པ་བསྒྲུབ་པ་གང་ཡིན་པ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that a woman can become Śakra, Māra, or Brahmā in that very body.

source: བུད་མེད་བདག་གི་དངོས་པོ་དེ་ཉིད་ཀྱིས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་བ་གང་ཡིན་པ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that a woman can become a universal monarch in that very body.

source: བུད་མེད་བདག་གི་དངོས་པོ་དེ་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་བ་གང་ཡིན་པ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that a woman can become a thus-gone, worthy, perfect buddha in that very body.

source: འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཉིས་འཇིག་རྟེན་དུ་འབྱུང་བ་གང་ཡིན་པ་ཡང་གནས་མ་ཡིན་ཞིང་སྐབས་མ་ཡིན་ནོ། །
en: It is also impossible and unfeasible that two thus-gone ones can appear in a single world.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of what is impossible.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཐོབ་པའི་གང་ཟག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, moreover, the Thus-Gone One correctly understands the state of beings who have become impossible recipients.

source: གང་ཟག་འདིས་སངས་རྒྱས་ཁྲག་ཁྲིག་འདི་སྙེད་ཅིག་ཐུགས་བྱུང་བར་བྱས་པས། དེ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་མ་ཡིན་པ་
en: He knows who is averse to billions of buddhas and who therefore is not a vessel for the teachings of the buddhas, the teachings of the solitary buddhas, or the teachings of the hearers.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In this way, the Thus-Gone One correctly understands the knowledge of what is impossible.

source: དེ་བཞིན་གཤེགས་པ་གནས་མ་ཡིན་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about what is impossible,

source: ཁྱིམ་བདག་གཞན་ཡང་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of what is impossible.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of what is impossible.

source: གལ་ཏེ་རྟག་པར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་སྡུག་བསྔལ་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་ནད་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་འབྲས་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་ཟུག་རྔུ་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་སྡིག་པ་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་གཞན་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་འཇིག་པ་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་གཡོ་བ་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་རབ་ཏུ་འཇིག་པ་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་འགོ་བའི་ནད་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་མི་སྟོང་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་བདག་ཡོད་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་དབུགས་འབྱུང་བ་མེད་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་ཉེས་དམིགས་མེད་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་གནོད་པ་མེད་པར་རྗེས་སུ་བལྟ་བའམ། གལ་ཏེ་ཕྱིར་རྒོལ་བ་མ་ཡིན་པར་རྗེས་སུ་བལྟ་བར་གནས་པ་འདི་ནི་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: Whether he considers permanence, no suffering, no disease, lack of results, lack of unease, no evil, no other, no disintegration, no movement, no destruction, no epidemic, no emptiness, existence of a self, lack of comfort, lack of faults, no harm, or no opposition, that is called knowing the origin as related to knowledge of what is impossible .

source: དེ་དེ་བཞིན་གཤེགས་པས་མཁྱེན། ཐུགས་སུ་ཆུད་མངོན་སུམ་དུ་མཛད་དོ། །
en: That is what the Thus-Gone One knows, understands, and actualizes.

source: དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་གང་གིས་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Therefore, the wisdom of the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of what is impossible.

source: འདི་ནི་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཞེས་བྱའོ། །
en: That is called knowing the origin as related to knowledge of what is impossible .

source: དེ་བཞིན་གཤེགས་པ་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about knowing the origin as related to what is impossible,

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་བླ་ན་མེད་པ་མཁྱེན་རབ་ཀྱིས་ཤིན་ཏུ་ཐུགས་སུ་ཆུད་པར་མཛད་ཅིང་།
en: It is because in his wisdom the Thus-Gone One knows the matchless sphere of reality.

source: དེ་ལྟ་བས་ན་འདིར་གང་གི་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པ་མེད་པར་འཇུག་པ་དེ་ནི། ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, with his unimpeded wisdom vision he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of what is impossible.

source: དེ་བཞིན་གཤེགས་པ་ལ་མ་བསྟེན་པའི་སེམས་ཅན་རྣམས་གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་གྱུར་ཅིང་། དེ་དེ་བཞིན་གཤེགས་པ་ལ་བསྟེན་ན་བྲལ་ཏེ།
en: He understands that when sentient beings do not rely on the Thus-Gone One, they are included under the knowledge of the origin as related to knowledge of what is impossible. However, if they rely on the Thus-Gone One, the origin ceases.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of what is impossible.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་། དོན་མ་ཡིན་པ་ཟློག་ལ།
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them.

source: སྣང་བ་བྱས་ཤིང་མུན་པ་བསལ་ཏེ།
en: He illuminated them and cleared away their darkness.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས།
en: He has freed innumerable beings from suffering and

source: བདེ་བ་ལ་བཙུད་པ་ནི་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: established them in happiness. That is the knowledge of cessation as related to knowledge of what is impossible.

source: དེ་ཡང་གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཆོས་ཅན་ནོ། །
en: Moreover, he knows it to be primordially unborn.

source: དེ་བཞིན་གཤེགས་པ་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of what is impossible,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of what is impossible.

source: ཤིན་ཏུ་རྨོངས་པ་གང་གིས་གནས་མ་ཡིན་པ་སྟོན་པ་ལ་མི་ཤེས་པ་བྱུང་བའི་ཤིན་ཏུ་རྨོངས་པ་དེ་ནི་ངོ་བོ་ཉིད་དང་བྲལ་བ་སྟེ།
en: The extreme delusion that produces ignorance with regard to impossible teachings, taught by extremely deluded people, is devoid of essential existence.

source: དེས་ན་ཤིན་ཏུ་རྨོངས་པའི་ཆོས་མེད་དེ།
en: Thus, since all phenomena lack intrinsic existence,

source: ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་དང་བྲལ་བའི་ཕྱིར་རོ། །
en: the phenomena of extreme delusion also do not exist.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, thus does the Thus-Gone One correctly understand the knowledge of the path that leads to cessation as related to knowledge of what is impossible.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་གནས་མ་ཡིན་པ་ཤེས་པ་ཡོངས་སུ་ཤེས་པའི་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Moreover, householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of what is impossible

source: གལ་ཏེ་རོ་མྱོང་བ་མེད་པར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་མེད་པར་རྗེས་སུ་བལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བ་མེད་པར་རྗེས་སུ་བལྟ་བར་གནས་པ་དེ།
en: whether he contemplates insipidity, or whether he contemplates no shortcomings, or whether he contemplates no deliverance.

source: དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands this.

source: དེ་བཞིན་གཤེགས་པ་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of what is impossible,

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་བླ་ན་མེད་པ་མཁྱེན་རབ་ཀྱིས་ཤིན་ཏུ་ཐུགས་སུ་ཆུད་ཅིང་།
en: It is because in his wisdom the Thus-Gone One knows the matchless sphere of reality.

source: དེ་བཞིན་གཤེགས་པས་གནས་མ་ཡིན་པར་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཞུ་བ་ཞུས་པ་ན།
en: In this way, when the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of what is impossible,

source: དེ་ལྟ་བས་ན་འདིར་གང་གིས་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པ་མེད་པར་འཇུག་པ་དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, with his unimpeded wisdom vision he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་གཞན་ཡང་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་འདས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the past.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་འདས་པའི་བསྐལ་པ་དཔག་ཏུ་མེད་པའི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands all buddhas, buddha realms, and beings that appeared in an immeasurable number of previous eons.

source: འདས་པའི་བསྐལ་པ་གྲངས་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞལ་དུ་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བ་དང་། བརྗོད་དུ་མེད་པའི་བར་དག་གི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the buddhas, buddha realms, and beings that appeared in an innumerable , inconceivable, incomparable, inestimable, and inexpressible number of previous eons.

source: འདས་པའི་བསྐལ་པ་དཔག་ཏུ་མེད་པའི་ཡང་དཔག་ཏུ་མེད་པ་དང་། དཔག་ཏུ་མེད་པའི་གྲངས་མེད་པ་དང་། དཔག་ཏུ་མེད་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དཔག་ཏུ་མེད་པའི་གཞལ་དུ་མེད་པ་དང་། དཔག་ཏུ་མེད་པའི་བརྗོད་དུ་མེད་པའི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the buddhas, buddha realms, and beings that appeared in an immeasurable number of immeasurable previous eons, an innumerable number of immeasurable previous eons, an inconceivable number of immeasurable previous eons, an incomparable number of immeasurable previous eons, and an inexpressible number of immeasurable previous eons.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་
en: In this way

source: འདས་པའི་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་དཔག་ཏུ་མེད་པ་དང་། བརྗོད་དུ་མེད་པའི་གྲངས་མེད་པ་དང་། བརྗོད་དུ་མེད་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བརྗོད་དུ་མེད་པའི་གཞལ་དུ་མེད་པ་དང་། བརྗོད་དུ་མེད་པའི་གཞལ་གྱིས་མི་ལང་བ་དང་། བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་གིས་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། སེམས་ཅན་རྣམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: he knows the buddhas, buddha realms, and beings of the previous eons all the way back to an immeasurable number of inexpressible previous eons, an innumerable number of inexpressible previous eons, an inconceivable number of inexpressible previous eons, an incomparable number of inexpressible previous eons, an inestimable number of inexpressible previous eons, and an inexpressible number of inexpressible previous eons.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་འདས་པ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be learned about this is called knowing the past, and

source: དེ་བཞིན་གཤེགས་པ་འདས་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about knowing the past,
